Public Member Functions | List of all members
API_AttributeFolderPicker Class Referenceabstract
Attribute Management
Describes an attribute folder picker created in ACAPI_Attribute_CreateAttributeFolderPicker, with getter and setter for the selected attribute folder and the hanlder of push check click event. More...
#include <APIdefs_Interface.h>
 Public Member Functions
virtual API_AttributeFolder  | GetSelectedAttributeFolder () const =0
Returns the selected attribute folder.
virtual void  | SetSelectedAttributeFolder (const API_AttributeFolder &folder)=0
Selects an attribute folder in the picker.
virtual bool  | Invoke ()=0
Handles click event to the push check: shows the picker popup dialog.
Detailed Description
Describes an attribute folder picker created in ACAPI_Attribute_CreateAttributeFolderPicker, with getter and setter for the selected attribute folder and the hanlder of push check click event.
Since
Archicad 26
Member Function Documentation
◆ GetSelectedAttributeFolder()
 virtual API_AttributeFolder API_AttributeFolderPicker::GetSelectedAttributeFolder  |  ( |   | ) |   const
pure virtual
Returns the selected attribute folder.
Returns
API_AttributeFolder type.
◆ Invoke()
 virtual bool API_AttributeFolderPicker::Invoke  |  ( |   | )
pure virtual
Handles click event to the push check: shows the picker popup dialog.
Returns
True if OK was clicked in the popup dialog, false otherwise.
◆ SetSelectedAttributeFolder()
 virtual void API_AttributeFolderPicker::SetSelectedAttributeFolder  |  ( |  const API_AttributeFolder &  |  folder | )
pure virtual
Selects an attribute folder in the picker.
Parameters
folder | [in], the attribute folder to select.